RDVMI.rdvmi-ext/src/ChartsOfCharacteristicTypes/рдв_НастройкиПрограммы/рдв_НастройкиПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>рдв_НастройкиПрограммы</name>
  <type>
    <types>CatalogRef.рдв_ВнешниеСистемы</types>
    <types>CatalogRef.рдв_ТипыОчередейОбработкиДанных</types>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>100</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Characteristic.рдв_НастройкиПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗначения</name>
    <type>
      <types>EnumRef.рдв_ВидыЗначенийНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКлюча</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рдв_НастройкиПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеЗначенияНастройки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьПовторноИспользуемыеЗначения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>рдв_Идентификатор</name>
    <type>
      <types>DefinedType.рдв_ПредопределенныеДанныеТип</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеЗначений</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>Characteristic.рдв_НастройкиПрограммы</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.рдв_НастройкиПрограммы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Значения</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.рдв_НастройкиПрограммы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

RDVMI.rdvmi-ext/src/Enums/рдв_ВидыЗначенийНастроек/рдв_ВидыЗначенийНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рдв_ВидыЗначенийНастроек</name>
  <comment>VELO-613</comment>
  <enumValues>
    <name>Значение</name>
  </enumValues>
  <enumValues>
    <name>Соответствие</name>
  </enumValues>
  <enumValues>
    <name>СписокЗначений</name>
  </enumValues>
</mdclass:Enum>

RDVMI.rdvmi-ext/src/ChartsOfCharacteristicTypes/рдв_НастройкиПрограммы/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает значение общей настройки программы.
//
// Параметры:
//  Настройка                - Строка, ПланВидовХарактеристикСсылка.рдв_НастройкиПрограммы
//                                    - имя предопределенного значения настройки или ссылка на настройку (ПВХ).
//  ПроверятьЗаполнение      - Булево - 
//  ОбязательноеЗаполнение   - Булево - 
// 
// Возвращаемое значение:
//  Характеристика.рдв_НастройкиПрограммы - значение настройки
//
Функция ЗначениеНастройки(Знач Настройка, ПроверятьЗаполнение = Истина, ОбязательноеЗаполнение = Ложь) Экспорт
	
	Если ТипЗнч(Настройка) = Тип("Строка") Тогда
		Настройка = ПланыВидовХарактеристик.рдв_НастройкиПрограммы[Настройка];
	КонецЕсли;
	
	ЗначениеНастройки = Настройка.Значение;
	
	Если Настройка.ВидЗначения = Перечисления.рдв_ВидыЗначенийНастроек.Соответствие Тогда
		// Проверка на заполненность соответствия
		
	ИначеЕсли Настройка.ВидЗначения = Перечисления.рдв_ВидыЗначенийНастроек.СписокЗначений Тогда
		// Проверка на заполненность соответствия
		
	Иначе
		// Проверка на заполненность значения
		Если Не ЗначениеЗаполнено(ЗначениеНастройки) И (ОбязательноеЗаполнение Или ПроверятьЗаполнение) Тогда
			ТекстСообщения = НСтр("ru = 'Необходимо заполнить значение настройки ""[Настройка]"".'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "[Настройка]", Формат(Настройка));
			Если ОбязательноеЗаполнение Тогда
				ВызватьИсключение ТекстСообщения; 
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Настройка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Настройка.ВидЗначения = Перечисления.рдв_ВидыЗначенийНастроек.Соответствие Тогда
		Возврат ТаблицаСоответствийВСоответствие(Настройка.СоответствиеЗначений, Настройка);
	ИначеЕсли Настройка.ВидЗначения = Перечисления.рдв_ВидыЗначенийНастроек.СписокЗначений Тогда
		Возврат ТаблицаЗначенийВМассив(Настройка.Значения, Настройка);
	Иначе
		Возврат Настройка.ТипЗначения.ПривестиЗначение(ЗначениеНастройки);
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцеудурыИФункции

Функция ТаблицаСоответствийВСоответствие(ТаблицаСоответствиеЗначений, Настройка)
	
	СоответствиеЗначений = Новый Соответствие;
	
	Для каждого СтрокаТЧ Из ТаблицаСоответствиеЗначений Цикл
		СоответствиеЗначений.Вставить(СтрокаТЧ.Ключ, Настройка.ТипЗначения.ПривестиЗначение(СтрокаТЧ.Значение));
	КонецЦикла;
	
	Возврат СоответствиеЗначений;
	
КонецФункции

Функция ТаблицаЗначенийВМассив(ТаблицаЗначений, Настройка)
	
	МассивЗначений = Новый Массив;
	
	Для Каждого СтрокаТЧ Из ТаблицаЗначений Цикл
		МассивЗначений.Добавить(Настройка.ТипЗначения.ПривестиЗначение(СтрокаТЧ.Значение));
	КонецЦикла;
	
	Возврат МассивЗначений;
	
КонецФункции

#КонецОбласти
